; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	image4 - mode
	image1 - mode
	image3 - mode
	infrared0 - mode
	spectrograph2 - mode
	Star2 - direction
	Star4 - direction
	Star1 - direction
	Star0 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	GroundStation3 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 infrared0)
	(supports instrument0 image3)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet8)
	(supports instrument1 spectrograph2)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 Star4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet10)
	(supports instrument2 image3)
	(supports instrument2 infrared0)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 Star0)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation5)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 image1)
	(supports instrument4 image3)
	(calibration_target instrument4 GroundStation3)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
	(supports instrument5 spectrograph2)
	(supports instrument5 image4)
	(calibration_target instrument5 GroundStation3)
	(calibration_target instrument5 GroundStation5)
	(supports instrument6 image1)
	(supports instrument6 image3)
	(supports instrument6 spectrograph2)
	(calibration_target instrument6 GroundStation3)
	(calibration_target instrument6 GroundStation6)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet8)
)
(:goal (and
	(pointing satellite3 Planet12)
	(have_image Star7 image4)
	(have_image Planet8 spectrograph2)
	(have_image Star9 image3)
	(have_image Planet10 image4)
	(have_image Planet11 infrared0)
	(have_image Planet12 image3)
	(have_image Planet13 image4)
	(have_image Phenomenon14 image4)
))

)

; plan
1. (turn_to satellite3 groundstation3 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 groundstation3)
   goals met: 0 of 9
2. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 0 of 9
3. (calibrate satellite3 instrument5 groundstation3)
   added: (calibrated instrument5)
   goals met: 0 of 9
4. (turn_to satellite3 planet13 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 planet13)
   goals met: 0 of 9
5. (take_image satellite3 planet13 instrument5 image4)
   added: (have_image planet13 image4)
   goals met: 1 of 9
6. (turn_to satellite3 planet10 planet13)
   deleted: (pointing satellite3 planet13)
   added: (pointing satellite3 planet10)
   goals met: 1 of 9
7. (take_image satellite3 planet10 instrument5 image4)
   added: (have_image planet10 image4)
   goals met: 2 of 9
8. (turn_to satellite3 phenomenon14 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 phenomenon14)
   goals met: 2 of 9
9. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 2 of 9
10. (calibrate satellite2 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 2 of 9
11. (take_image satellite3 phenomenon14 instrument5 image4)
   added: (have_image phenomenon14 image4)
   goals met: 3 of 9
12. (turn_to satellite2 planet11 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 planet11)
   goals met: 3 of 9
13. (take_image satellite2 planet11 instrument2 infrared0)
   added: (have_image planet11 infrared0)
   goals met: 4 of 9
14. (turn_to satellite2 planet12 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 planet12)
   goals met: 4 of 9
15. (take_image satellite2 planet12 instrument2 image3)
   added: (have_image planet12 image3)
   goals met: 5 of 9
16. (turn_to satellite2 planet8 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 planet8)
   goals met: 5 of 9
17. (take_image satellite2 planet8 instrument2 spectrograph2)
   added: (have_image planet8 spectrograph2)
   goals met: 6 of 9
18. (turn_to satellite2 star9 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 star9)
   goals met: 6 of 9
19. (take_image satellite2 star9 instrument2 image3)
   added: (have_image star9 image3)
   goals met: 7 of 9
20. (turn_to satellite3 star7 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 star7)
   goals met: 7 of 9
21. (take_image satellite3 star7 instrument5 image4)
   added: (have_image star7 image4)
   goals met: 8 of 9
22. (turn_to satellite3 planet12 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 planet12)
   goals met: 9 of 9
